In [147]:
import pandas as pd
import numpy as np

In [148]:
dictionaryData = {"Istanbul": [30, 29, np.nan], "Ankara": [20, np.nan, 38], "Izmir": [40, 35, 38]}
weatherDataFrame = pd.DataFrame(dictionaryData)

In [149]:
weatherDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     35
2       NaN    38.0     38

In [150]:
weatherDataFrame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [151]:
weatherDataFrame.dropna(axis = 1)

   Izmir
0     40
1     35
2     38

In [152]:
newDictionaryData = {"Istanbul": [30, 29, np.nan], "Ankara": [20, np.nan, 38], "Izmir": [40, 35, 38], "Antalya": [45, np.nan, np.nan]}
newWeatherDataFrame = pd.DataFrame(newDictionaryData)

In [153]:
newWeatherDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     35      NaN
2       NaN    38.0     38      NaN

In [154]:
newWeatherDataFrame.dropna(axis = 1, thresh = 2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     35
2       NaN    38.0     38

In [155]:
newWeatherDataFrame.fillna(0)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     0.0     35      0.0
2       0.0    38.0     38      0.0

## GroupBy

In [156]:
salaryDictionary = {"Department": ["Software", "Sales", "Software", "HR", "HR", "Sales"], 
                    "Worker": ["Jane", "Kris", "Anya", "Hans", "Levi", "Wrang"], 
                    "Salary": [100, 100, 200, 150, 180, 90]}
salaryDataFrame = pd.DataFrame(salaryDictionary)

In [157]:
salaryDataFrame

  Department Worker  Salary
0   Software   Jane     100
1      Sales   Kris     100
2   Software   Anya     200
3         HR   Hans     150
4         HR   Levi     180
5      Sales  Wrang      90

In [158]:
groupObject = salaryDataFrame.groupby("Department")

In [159]:
groupObject.count()

            Worker  Salary
Department
HR               2       2
Sales            2       2
Software         2       2

In [160]:
groupObject.mean

In [161]:
groupObject.min()

           Worker  Salary
Department
HR           Hans     150
Sales        Kris      90
Software     Anya     100

In [162]:
groupObject.max()

           Worker  Salary
Department
HR           Levi     180
Sales       Wrang     100
Software     Jane     200

In [163]:
groupObject.describe()

           Salary
            count   mean        std    min    25%    50%    75%    max
Department
HR            2.0  165.0  21.213203  150.0  157.5  165.0  172.5  180.0
Sales         2.0   95.0   7.071068   90.0   92.5   95.0   97.5  100.0
Software      2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0

## Concatenation

In [164]:
firstDictionary = { "Name": ["Jane", "Jhon", "Jhin", "Jack"],
                    "Sports": ["Running", "Swimming", "Running", "Basketball"],
                    "Calories": [100, 200, 100, 300] 
                  }
firstDataFrame = pd.DataFrame(firstDictionary, index = [0, 1, 2, 3])

In [165]:
firstDataFrame

   Name      Sports  Calories
0  Jane     Running       100
1  Jhon    Swimming       200
2  Jhin     Running       100
3  Jack  Basketball       300

In [166]:
secondDictionary = { "Name": ["August", "Anya", "Alya", "Albert"],
                    "Sports": ["Running", "Swimming", "Running", "Basketball"],
                    "Calories": [200, 250, 300, 300] 
                  }
secondDataFrame = pd.DataFrame(secondDictionary, index = [4, 5, 6, 7])

In [167]:
secondDataFrame

     Name      Sports  Calories
4  August     Running       200
5    Anya    Swimming       250
6    Alya     Running       300
7  Albert  Basketball       300

In [168]:
thirthDictionary = { "Name": ["Elsa", "Emily", "Emma", "Elif"],
                    "Sports": ["Running", "Swimming", "Running", "Basketball"],
                    "Calories": [210, 220, 340, 100] 
                  }
thirthDataFrame = pd.DataFrame(thirthDictionary, index = [8, 9, 10, 11])

In [169]:
thirthDataFrame

     Name      Sports  Calories
8    Elsa     Running       210
9   Emily    Swimming       220
10   Emma     Running       340
11   Elif  Basketball       100

In [170]:
pd.concat([firstDataFrame, secondDataFrame, thirthDataFrame])

      Name      Sports  Calories
0     Jane     Running       100
1     Jhon    Swimming       200
2     Jhin     Running       100
3     Jack  Basketball       300
4   August     Running       200
5     Anya    Swimming       250
6     Alya     Running       300
7   Albert  Basketball       300
8     Elsa     Running       210
9    Emily    Swimming       220
10    Emma     Running       340
11    Elif  Basketball       100

## Merge

In [171]:
firstMergeDictionary = { "Name": ["Marry", "Tesla", "Joseph", "Olga"],
                         "Sports": ["Running", "Swimming", "Running", "Basketball"]
                       }
firstMergeDataFrame = pd.DataFrame(firstMergeDictionary)

In [172]:
firstMergeDataFrame

     Name      Sports
0   Marry     Running
1   Tesla    Swimming
2  Joseph     Running
3    Olga  Basketball

In [173]:
secondMergeDictionary = { "Name": ["Marry", "Tesla", "Joseph", "Olga"],
                          "Calories": [100, 150, 120, 180]
                        }
secondMergeDataFrame = pd.DataFrame(secondMergeDictionary)

In [174]:
secondMergeDataFrame

     Name  Calories
0   Marry       100
1   Tesla       150
2  Joseph       120
3    Olga       180

In [175]:
pd.merge(firstMergeDataFrame, secondMergeDataFrame, on = "Name")

     Name      Sports  Calories
0   Marry     Running       100
1   Tesla    Swimming       150
2  Joseph     Running       120
3    Olga  Basketball       180

## Other Methods

In [176]:
workerDictionary = {"Department": ["Software", "Sales", "Software", "HR", "HR", "Sales"], 
                    "Name": ["Jane", "Kris", "Anya", "Hans", "Levi", "Wrang"], 
                    "Salary": [100, 100, 200, 150, 180, 90]}
workerDataFrame = pd.DataFrame(workerDictionary)

In [177]:
workerDataFrame

  Department   Name  Salary
0   Software   Jane     100
1      Sales   Kris     100
2   Software   Anya     200
3         HR   Hans     150
4         HR   Levi     180
5      Sales  Wrang      90

In [178]:
workerDataFrame["Department"].unique()

array(['Software', 'Sales', 'HR'], dtype=object)

In [179]:
workerDataFrame["Department"].nunique()

3

In [180]:
workerDataFrame["Department"].value_counts()

Department
Software    2
Sales       2
HR          2
Name: count, dtype: int64

In [181]:
def grossToNetPay(salary):
    return salary * 0.66

In [184]:
workerDataFrame["Salary"].apply(grossToNetPay)

0     66.0
1     66.0
2    132.0
3     99.0
4    118.8
5     59.4
Name: Salary, dtype: float64

In [185]:
workerDataFrame.isnull()

   Department   Name  Salary
0       False  False   False
1       False  False   False
2       False  False   False
3       False  False   False
4       False  False   False
5       False  False   False

In [189]:
newDictionary = { "Cartoon Character": ["South Park", "South Park", "Simpson", "Simpson", "Simpson"],
                  "Name": ["Cartman", "Kenny", "Homer", "Bart", "Bart"],
                  "Age": [9, 19, 54, 12, 10]
                }
newDataFrame = pd.DataFrame(newDictionary)

In [190]:
newDataFrame

  Cartoon Character     Name  Age
0        South Park  Cartman    9
1        South Park    Kenny   19
2           Simpson    Homer   54
3           Simpson     Bart   12
4           Simpson     Bart   10

In [191]:
newDataFrame.pivot_table(values = "Age", index = ["Cartoon Character", "Name"])

                            Age
Cartoon Character Name
Simpson           Bart     11.0
                  Homer    54.0
South Park        Cartman   9.0
                  Kenny    19.0

In [194]:
newDataFrame.pivot_table(values = "Age", index = ["Cartoon Character", "Name"], aggfunc = np.sum)

C:\Users\gunee\AppData\Local\Temp\ipykernel_23392\1537188164.py:1: FutureWarning: The provided callable <function sum at 0x0000024695270860> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  newDataFrame.pivot_table(values = "Age", index = ["Cartoon Character", "Name"], aggfunc = np.sum)

                           Age
Cartoon Character Name
Simpson           Bart      22
                  Homer     54
South Park        Cartman    9
                  Kenny     19